Revit 2027 API
ParameterTypeId.StructConnectionBeamStart Property
 "Start Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructConnectionBeamStart { get; }
Public Shared ReadOnly Property StructConnectionBeamStart As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructConnectionBeamStart {
	ForgeTypeId^ get ();
}
static member StructConnectionBeamStart : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace